In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row 1', 'Row 2', 'Row 3', 'Row 4', 'Row 5'], columns=["Col 1", "Col 2", "Col 3", "Col 4"])

df

       Col 1  Col 2  Col 3  Col 4
Row 1      0      1      2      3
Row 2      4      5      6      7
Row 3      8      9     10     11
Row 4     12     13     14     15
Row 5     16     17     18     19

In [4]:
df.to_csv('Test.csv')

Accessing the elements

1 - loc
2 - iloc

In [7]:
df.loc['Row 1']

Col 1    0
Col 2    1
Col 3    2
Col 4    3
Name: Row 1, dtype: int32

In [9]:
type(df.loc['Row 1'])

pandas.core.series.Series

In [11]:
df.iloc[:,:] #all rows and columns

       Col 1  Col 2  Col 3  Col 4
Row 1      0      1      2      3
Row 2      4      5      6      7
Row 3      8      9     10     11
Row 4     12     13     14     15
Row 5     16     17     18     19

In [12]:
df.iloc[0:3, 0:2]

       Col 1  Col 2
Row 1      0      1
Row 2      4      5
Row 3      8      9

In [13]:
type(df.iloc[0:3, 0:2])

pandas.core.frame.DataFrame

In [15]:
type(df.iloc[0:2, 0])

pandas.core.series.Series

In [16]:
#convert dataframe to array

df.iloc[:, 1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [17]:
df['Col 1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Col 1, dtype: int64

In [18]:
df.isnull()

       Col 1  Col 2  Col 3  Col 4
Row 1  False  False  False  False
Row 2  False  False  False  False
Row 3  False  False  False  False
Row 4  False  False  False  False
Row 5  False  False  False  False

In [19]:
df.isnull().sum()

Col 1    0
Col 2    0
Col 3    0
Col 4    0
dtype: int64

In [20]:
df['Col 2'].unique()

array([ 1,  5,  9, 13, 17])

In [21]:
df[['Col 3', 'Col 4']]

       Col 3  Col 4
Row 1      2      3
Row 2      6      7
Row 3     10     11
Row 4     14     15
Row 5     18     19